IRP/src/AccumulationRegisters/TaxesTurnovers/TaxesTurnovers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>TaxesTurnovers</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>ManualAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>NetAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>DeferredCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DefinedType.typeObjectWithTaxes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Tax</name>
    <type>
      <types>CatalogRef.Taxes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Analytics</name>
    <type>
      <types>CatalogRef.TaxAnalytics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TaxRate</name>
    <type>
      <types>CatalogRef.TaxRates</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IncludeToTotalAmount</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RowKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/TaxesTurnovers/ManagerModule.bsl
Function GetLockFields(Data) Export
	Result = New Structure();
	Result.Insert("RegisterName", "AccumulationRegister.TaxesTurnovers");
	Fields = New Map();
	Fields.Insert("Document", "Document");
	Fields.Insert("Tax", "Tax");
	Fields.Insert("Analytics", "Analytics");
	Fields.Insert("TaxRate", "TaxRate");
	Fields.Insert("IncludeToTotalAmount", "IncludeToTotalAmount");
	Fields.Insert("RowKey", "RowKey");
	Result.Insert("LockInfo", New Structure("Data, Fields", Data, Fields));
	Return Result;
EndFunction
